Ran Plan for project: `prod` dir: `etc/terraform/environments` workspace: `prod`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds-postgresql...
- rds-postgresql in .terraform/modules/rds-postgresql/aws/rds/postgresql
- rds-postgresql.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db in .terraform/modules/rds-postgresql/aws/rds/db
- rds-postgresql.db.asg_bastion in .terraform/modules/rds-postgresql/aws/ec2/asg
- rds-postgresql.db.asg_bastion.ami in .terraform/modules/rds-postgresql/aws/ec2/ami
- rds-postgresql.db.asg_bastion.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.asg_bastion.cloud_init in .terraform/modules/rds-postgresql/aws/ec2/cloud_init
- rds-postgresql.db.asg_bastion.iam in .terraform/modules/rds-postgresql/aws/iam/instance
- rds-postgresql.db.asg_bastion.iam.instance_profile in .terraform/modules/rds-postgresql/aws/iam/instance_profile
- rds-postgresql.db.asg_bastion.iam.instance_profile.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.asg_bastion.iam.instance_s3 in .terraform/modules/rds-postgresql/aws/iam/instance_s3_bucket_path
- rds-postgresql.db.asg_bastion.iam.secrets in .terraform/modules/rds-postgresql/aws/iam/policy_secrets
- rds-postgresql.db.asg_bastion.iam.secrets.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.kms in .terraform/modules/rds-postgresql/aws/kms
- rds-postgresql.db.rds_variables in .terraform/modules/rds-postgresql/aws/rds/variables

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/random versions matching "~> 3.3"...
- Finding hashicorp/local versions matching "~> 2.1"...
- Finding hashicorp/aws versions matching ">= 4.9.0, ~> 4.9"...
- Finding datadog/datadog versions matching "~> 3.1"...
- Finding hashicorp/template versions matching "~> 2.1"...
- Installing datadog/datadog v3.19.1...
- Installed datadog/datadog v3.19.1 (signed by a HashiCorp partner, key ID FB70BE941301C3EA)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)
- Installing hashicorp/random v3.4.3...
- Installed hashicorp/random v3.4.3 (signed by HashiCorp)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (signed by HashiCorp)
- Installing hashicorp/aws v4.48.0...
- Installed hashicorp/aws v4.48.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "prod".

Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds-postgresql...
- rds-postgresql in .terraform/modules/rds-postgresql/aws/rds/postgresql
- rds-postgresql.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db in .terraform/modules/rds-postgresql/aws/rds/db
- rds-postgresql.db.asg_bastion in .terraform/modules/rds-postgresql/aws/ec2/asg
- rds-postgresql.db.asg_bastion.ami in .terraform/modules/rds-postgresql/aws/ec2/ami
- rds-postgresql.db.asg_bastion.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.asg_bastion.cloud_init in .terraform/modules/rds-postgresql/aws/ec2/cloud_init
- rds-postgresql.db.asg_bastion.iam in .terraform/modules/rds-postgresql/aws/iam/instance
- rds-postgresql.db.asg_bastion.iam.instance_profile in .terraform/modules/rds-postgresql/aws/iam/instance_profile
- rds-postgresql.db.asg_bastion.iam.instance_profile.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.asg_bastion.iam.instance_s3 in .terraform/modules/rds-postgresql/aws/iam/instance_s3_bucket_path
- rds-postgresql.db.asg_bastion.iam.secrets in .terraform/modules/rds-postgresql/aws/iam/policy_secrets
- rds-postgresql.db.asg_bastion.iam.secrets.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.aws_variables in .terraform/modules/rds-postgresql/aws/variables
- rds-postgresql.db.kms in .terraform/modules/rds-postgresql/aws/kms
- rds-postgresql.db.rds_variables in .terraform/modules/rds-postgresql/aws/rds/variables


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_application.module.ecs_service.aws_ecs_service.this will be updated in-place
! resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:165908609791:service/logicalis-poc-prod/logicalis-poc-prod"
        name                               = "logicalis-poc-prod"
        tags                               = {
            "Application" = "logicalis-poc"
            "Deployment"  = "terraform"
            "Environment" = "prod"
            "Monitored"   = "datadog"
            "Name"        = "logicalis-poc-prod"
            "Owner"       = "chufis"
            "Resource"    = "ecs-service"
        }
        # (16 unchanged attributes hidden)




!       network_configuration {
!           security_groups  = [
-               "sg-0feda795071d3e3b0",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.rds-postgresql.module.db.data.aws_kms_key.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_kms_key" "this"  {
+       arn                        = (known after apply)
+       aws_account_id             = (known after apply)
+       creation_date              = (known after apply)
+       customer_master_key_spec   = (known after apply)
+       deletion_date              = (known after apply)
+       description                = (known after apply)
+       enabled                    = (known after apply)
+       expiration_model           = (known after apply)
+       id                         = (known after apply)
+       key_id                     = "alias/aws/rds"
+       key_manager                = (known after apply)
+       key_state                  = (known after apply)
+       key_usage                  = (known after apply)
+       multi_region               = (known after apply)
+       multi_region_configuration = (known after apply)
+       origin                     = (known after apply)
+       valid_to                   = (known after apply)
    }

  # module.rds-postgresql.module.db.aws_autoscaling_lifecycle_hook.lifecycle-launching will be created
+ resource "aws_autoscaling_lifecycle_hook" "lifecycle-launching" {
+       autoscaling_group_name = "bastion-v2-logicalis-poc-prod"
+       default_result         = "CONTINUE"
+       heartbeat_timeout      = 60
+       id                     = (known after apply)
+       lifecycle_transition   = "autoscaling:EC2_INSTANCE_LAUNCHING"
+       name                   = "lifecycle-launching"
    }

  # module.rds-postgresql.module.db.aws_autoscaling_lifecycle_hook.lifecycle-terminating will be created
+ resource "aws_autoscaling_lifecycle_hook" "lifecycle-terminating" {
+       autoscaling_group_name = "bastion-v2-logicalis-poc-prod"
+       default_result         = "CONTINUE"
+       heartbeat_timeout      = 60
+       id                     = (known after apply)
+       lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
+       name                   = "lifecycle-terminating"
    }

  # module.rds-postgresql.module.db.aws_db_instance.rds will be created
+ resource "aws_db_instance" "rds" {
+       address                               = (known after apply)
+       allocated_storage                     = 100
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = 10
+       backup_window                         = "00:00-02:00"
+       ca_cert_identifier                    = "rds-ca-2019"
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = true
+       db_name                               = (known after apply)
+       db_subnet_group_name                  = (known after apply)
+       delete_automated_backups              = true
+       deletion_protection                   = true
+       enabled_cloudwatch_logs_exports       = [
+           "postgresql",
+           "upgrade",
        ]
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_version                        = "13.7"
+       engine_version_actual                 = (known after apply)
+       final_snapshot_identifier             = "logicalis-poc-prod-final"
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "logicalis-poc-prod"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t4g.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       maintenance_window                    = "sat:02:00-sat:04:00"
+       max_allocated_storage                 = 0
+       monitoring_interval                   = 60
+       monitoring_role_arn                   = "arn:aws:iam::165908609791:role/rds-monitoring-role"
+       multi_az                              = true
+       name                                  = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       performance_insights_enabled          = true
+       performance_insights_kms_key_id       = "arn:aws:kms:eu-west-1:165908609791:key/5aee8a46-fce0-4a45-85a8-3069702b3296"
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = false
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_encrypted                     = false
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags                                  = {
+           "Application" = "logicalis-poc"
+           "Backup"      = "daily"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "rds"
+           "Scheduler"   = ""
        }
+       tags_all                              = {
+           "Application" = "logicalis-poc"
+           "Backup"      = "daily"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "rds"
+           "Scheduler"   = (known after apply)
        }
+       timezone                              = (known after apply)
+       username                              = (known after apply)
+       vpc_security_group_ids                = (known after apply)
    }

  # module.rds-postgresql.module.db.aws_db_subnet_group.rds will be created
+ resource "aws_db_subnet_group" "rds" {
+       arn                     = (known after apply)
+       description             = "DB subnet group for logicalis-poc-prod RDS."
+       id                      = (known after apply)
+       name                    = "logicalis-poc-prod"
+       name_prefix             = (known after apply)
+       subnet_ids              = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "subnet-group"
        }
+       tags_all                = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "subnet-group"
        }
    }

  # module.rds-postgresql.module.db.aws_route53_record.main will be created
+ resource "aws_route53_record" "main" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "logicalis-poc-prod.db.clidom.es"
+       records         = (known after apply)
+       ttl             = 300
+       type            = "CNAME"
+       zone_id         = "Z3VBSH4Z3N3V93"
    }

  # module.rds-postgresql.module.db.aws_secretsmanager_secret.this will be created
+ resource "aws_secretsmanager_secret" "this" {
+       arn                            = (known after apply)
+       description                    = "Credentials for logicalis-poc-prod RDS database."
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "logicalis-poc-prod-rds"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags                           = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "secret"
        }
+       tags_all                       = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "secret"
        }

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.rds-postgresql.module.db.aws_secretsmanager_secret_version.this will be created
+ resource "aws_secretsmanager_secret_version" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.rds-postgresql.module.db.aws_security_group.access_to_rds will be created
+ resource "aws_security_group" "access_to_rds" {
+       arn                    = (known after apply)
+       description            = "Instances with this group attached will have access to RDS logicalis-poc-prod"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "access-logicalis-poc-prod-rds"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "access-logicalis-poc-prod-rds"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "access-logicalis-poc-prod-rds"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds-postgresql.module.db.aws_security_group.rds will be created
+ resource "aws_security_group" "rds" {
+       arn                    = (known after apply)
+       description            = "Security group for logicalis-poc-prod RDS."
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = "postgres port"
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 5432
            },
        ]
+       name                   = "logicalis-poc-prod-rds"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-rds"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds-postgresql.module.db.random_password.password will be created
+ resource "random_password" "password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 41
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "!#$%&*()-_=+[]{}<>:?"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.rds-postgresql.module.db.random_string.username will be created
+ resource "random_string" "username" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # module.rds-postgresql.module.db.module.asg_bastion.aws_autoscaling_group.instance will be created
+ resource "aws_autoscaling_group" "instance" {
+       arn                       = (known after apply)
+       availability_zones        = (known after apply)
+       default_cooldown          = (known after apply)
+       desired_capacity          = 1
+       enabled_metrics           = [
+           "GroupDesiredCapacity",
+           "GroupInServiceCapacity",
+           "GroupInServiceInstances",
+           "GroupMaxSize",
+           "GroupMinSize",
+           "GroupPendingCapacity",
+           "GroupPendingInstances",
+           "GroupStandbyCapacity",
+           "GroupStandbyInstances",
+           "GroupTerminatingCapacity",
+           "GroupTerminatingInstances",
+           "GroupTotalCapacity",
+           "GroupTotalInstances",
        ]
+       force_delete              = true
+       force_delete_warm_pool    = false
+       health_check_grace_period = 300
+       health_check_type         = "EC2"
+       id                        = (known after apply)
+       max_size                  = 1
+       metrics_granularity       = "1Minute"
+       min_size                  = 0
+       name                      = "bastion-v2-logicalis-poc-prod"
+       name_prefix               = (known after apply)
+       protect_from_scale_in     = false
+       service_linked_role_arn   = (known after apply)
+       termination_policies      = []
+       vpc_zone_identifier       = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       wait_for_capacity_timeout = "10m"

+       mixed_instances_policy {
+           instances_distribution {
+               on_demand_allocation_strategy            = "prioritized"
+               on_demand_base_capacity                  = 0
+               on_demand_percentage_above_base_capacity = 100
+               spot_allocation_strategy                 = "capacity-optimized"
+               spot_instance_pools                      = 0
            }

+           launch_template {
+               launch_template_specification {
+                   launch_template_id   = (known after apply)
+                   launch_template_name = "bastion-v2-logicalis-poc-prod"
+                   version              = "$Latest"
                }
            }
        }

+       tag {
+           key                 = "Application"
+           propagate_at_launch = true
+           value               = "bastion-v2-logicalis-poc"
        }
+       tag {
+           key                 = "Deployment"
+           propagate_at_launch = true
+           value               = "terraform"
        }
+       tag {
+           key                 = "Environment"
+           propagate_at_launch = true
+           value               = "prod"
        }
+       tag {
+           key                 = "Monitored"
+           propagate_at_launch = true
+           value               = "datadog"
        }
+       tag {
+           key                 = "Name"
+           propagate_at_launch = true
+           value               = "bastion-v2-logicalis-poc-prod"
        }
+       tag {
+           key                 = "Resource"
+           propagate_at_launch = true
+           value               = "instance"
        }
    }

  # module.rds-postgresql.module.db.module.asg_bastion.aws_autoscaling_schedule.eco_mode_off[0] will be created
+ resource "aws_autoscaling_schedule" "eco_mode_off" {
+       arn                    = (known after apply)
+       autoscaling_group_name = "bastion-v2-logicalis-poc-prod"
+       desired_capacity       = 1
+       end_time               = (known after apply)
+       id                     = (known after apply)
+       max_size               = 1
+       min_size               = 0
+       recurrence             = "0 6 * * MON-FRI"
+       scheduled_action_name  = "bastion-v2-logicalis-poc-prod-asg-eco-mode-off"
+       start_time             = (known after apply)
+       time_zone              = "Europe/Madrid"
    }

  # module.rds-postgresql.module.db.module.asg_bastion.aws_autoscaling_schedule.eco_mode_on[0] will be created
+ resource "aws_autoscaling_schedule" "eco_mode_on" {
+       arn                    = (known after apply)
+       autoscaling_group_name = "bastion-v2-logicalis-poc-prod"
+       desired_capacity       = 0
+       end_time               = (known after apply)
+       id                     = (known after apply)
+       max_size               = 1
+       min_size               = 0
+       recurrence             = "0 20 * * MON-FRI"
+       scheduled_action_name  = "bastion-v2-logicalis-poc-prod-asg-eco-mode-on"
+       start_time             = (known after apply)
+       time_zone              = "Europe/Madrid"
    }

  # module.rds-postgresql.module.db.module.asg_bastion.aws_launch_template.instance will be created
+ resource "aws_launch_template" "instance" {
+       arn                     = (known after apply)
+       default_version         = (known after apply)
+       description             = "Launch template for bastion-v2-logicalis-poc-prod autoscaling group."
+       disable_api_termination = false
+       ebs_optimized           = "true"
+       id                      = (known after apply)
+       image_id                = "ami-0012c8d9bc7b87c57"
+       instance_type           = "t4g.micro"
+       latest_version          = (known after apply)
+       name                    = "bastion-v2-logicalis-poc-prod"
+       name_prefix             = (known after apply)
+       tags                    = {
+           "Application" = "bastion-v2-logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-v2-logicalis-poc-prod"
+           "OS"          = "Ubuntu"
+           "Platform"    = "linux"
+           "Resource"    = "launch-template"
+           "Version"     = "20.04"
        }
+       tags_all                = {
+           "Application" = "bastion-v2-logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-v2-logicalis-poc-prod"
+           "OS"          = "Ubuntu"
+           "Platform"    = "linux"
+           "Resource"    = "launch-template"
+           "Version"     = "20.04"
        }
+       update_default_version  = true
+       user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0ic2hlbGxzY3JpcHQtMTAtYW5zaXN0cmFuby5zaCINCkNvbnRlbnQtVHJhbnNmZXItRW5jb2Rpbmc6IDdiaXQNCkNvbnRlbnQtVHlwZTogdGV4dC94LXNoZWxsc2NyaXB0DQpNaW1lLVZlcnNpb246IDEuMA0KDQojIS91c3IvYmluL2VudiBiYXNoCiMgQ29uZmlnCkRJUl9TU0g9L3Jvb3QvLnNzaApESVJfR0lUPS9yb290L2RlcGxveW1lbnRzCkFXU19SRUdJT049YHdnZXQgLXFPLSBodHRwOi8vaW5zdGFuY2UtZGF0YS9sYXRlc3QvbWV0YS1kYXRhL3BsYWNlbWVudC9hdmFpbGFiaWxpdHktem9uZSB8IHNlZCAncy8uJC8vJ2AKZXhwb3J0IEhPTUU9L3Jvb3QKCiMgR2V0IFJTQSBwcml2YXRlIGtleQphd3MgczMgY3AgczM6Ly9ob2xhbHV6LXdlYi1zZWNyZXRzL2dpdGh1Yi9pZF9yc2EgJERJUl9TU0gvaWRfcnNhIC0tcmVnaW9uICRBV1NfUkVHSU9OCmNobW9kIDYwMCAkRElSX1NTSC9pZF9yc2EKCiMgQWRkIEdpdEh1YiB0byBrbm93biBob3N0IGxpc3QKc3NoLWtleXNjYW4gZ2l0aHViLmNvbSA+PiAkRElSX1NTSC9rbm93bl9ob3N0cwpjaG1vZCA2NDQgJERJUl9TU0gva25vd25faG9zdHMKCiMgQ2xvbmUgRGVwbG95bWVudHMgcmVwb3NpdG9yeQpnaXQgY2xvbmUgLWIgbWFzdGVyIGdpdEBnaXRodWIuY29tOmhvbGFsdXovZGVwbG95bWVudHMuZ2l0ICRESVJfR0lULwoKIyBJbnN0YWxsIEFuc2libGUgcmVxdWlyZW1lbnRzCmFuc2libGUtZ2FsYXh5IGluc3RhbGwgLXIgJERJUl9HSVQvcmVxdWlyZW1lbnRzLnltbCAtLXJvbGVzLXBhdGg9JERJUl9HSVQvcm9sZXMKCiMgRGVwbG95IEFwcHMKZm9yIGFwcGxpY2F0aW9uIGluIGJhc3Rpb24tdjItbG9naWNhbGlzLXBvYwpkbwogIEZJTEU9JERJUl9HSVQvZGVwbG95LSRhcHBsaWNhdGlvbi1wcm9kLnltbAogIGFuc2libGUtcGxheWJvb2sgJEZJTEUgLXUgcm9vdCAtLWNvbm5lY3Rpb249bG9jYWwgLWkgImxvY2FsaG9zdCwiIC1lICJhbnNpYmxlX2hvc3RzPWxvY2FsaG9zdCIKZG9uZQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0iY2xvdWRpbml0LWNvbmZpZy10ZW1wbGF0ZS55bWwiDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCnJlcG9fdXBkYXRlOiB0cnVlCnJlcG9fdXBncmFkZTogYWxsCmFwdF9yZWJvb3RfaWZfcmVxdWlyZWQ6IHRydWUKCnRpbWV6b25lOiBVVEMKCmZpbmFsX21lc3NhZ2U6ICJTeXN0ZW0gYm9vdCAodmlhIGNsb3VkLWluaXQpIGlzIENPTVBMRVRFLCBhZnRlciAkVVBUSU1FIHNlY29uZHMuIgoKb3V0cHV0OgogIGFsbDogJ3wgdGVlIC1hIC92YXIvbG9nL2Nsb3VkLWluaXQtb3V0cHV0LmxvZycKDQotLU1JTUVCT1VOREFSWQ0KQ29udGVudC1EaXNwb3NpdGlvbjogYXR0YWNobWVudDsgZmlsZW5hbWU9InNoZWxsc2NyaXB0LTA1LWRlZmluZS10YWdzLWFzLWVudmlyb25tZW50LXZhcmlhYmxlcy5zaCINCkNvbnRlbnQtVHJhbnNmZXItRW5jb2Rpbmc6IDdiaXQNCkNvbnRlbnQtVHlwZTogdGV4dC94LXNoZWxsc2NyaXB0DQpNaW1lLVZlcnNpb246IDEuMA0KDQojIS91c3IvYmluL2VudiBiYXNoCgojIFRoaXMgc2NyaXB0IG9idGFpbnMgdGhlIHRhZ3Mgc3BlY2lmaWVkIGFuZCBzZXRzIHRoZW0gYXMgZW52aXJvbm1lbnQgdmFyaWFibGVzCiMgV2hpY2ggdGFncz8KIyBUaGUgb25lcyBkZWZpbmVkIGF0IFRBR1MgdmFyaWFibGUsIGN1cnJlbnRseSAtPiBOYW1lLCBBcHBsaWNhdGlvbiBhbmQgRW52aXJvbm1lbnQKIyBBZGQgbW9yZSBieSBtb2RpZnlpbmcgdGhlIFRBR1MgaW4gdGhpcyBwYXJ0IC0+ICJOYW1lPWtleSxWYWx1ZXM9TmFtZSxBcHBsaWNhdGlvbixFbnZpcm9ubWVudCIKClJFR0lPTj0kKGVjMm1ldGFkYXRhIC0tYXZhaWxhYmlsaXR5LXpvbmUgfCBzZWQgJ3MvLiQvLycpCklOU1RBTkNFX0lEPSQoZWMybWV0YWRhdGEgLS1pbnN0YW5jZS1pZCkKClRBR1M9JChhd3MgZWMyIGRlc2NyaWJlLXRhZ3MgLS1yZWdpb24gIiRSRUdJT04iIC0tZmlsdGVycyAiTmFtZT1yZXNvdXJjZS1pZCxWYWx1ZXM9JElOU1RBTkNFX0lEIiAiTmFtZT1rZXksVmFsdWVzPU5hbWUsQXBwbGljYXRpb24sRW52aXJvbm1lbnQiIC0tcXVlcnkgVGFnc1tdIC0tb3V0cHV0IGpzb24pCgpmb3Igcm93IGluICQoZWNobyAiJHtUQUdTfSIgfCBqcSAtciAnLltdIHwgQGJhc2U2NCcpOyBkbwogIF9qcSgpIHsKICAgIGVjaG8gIiR7cm93fSIgfCBiYXNlNjQgLS1kZWNvZGUgfCBqcSAtciAiJHsxfSIKICB9CiAgZWNobyAiJChfanEgJy5LZXknKSI9IiQoX2pxICcuVmFsdWUnKSIgPj4gL2V0Yy9lbnZpcm9ubWVudApkb25lCgpzb3VyY2UgL2V0Yy9lbnZpcm9ubWVudAoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0ic2hlbGxzY3JpcHQtMDUtc2V0LWhvc3RuYW1lLnNoIg0KQ29udGVudC1UcmFuc2Zlci1FbmNvZGluZzogN2JpdA0KQ29udGVudC1UeXBlOiB0ZXh0L3gtc2hlbGxzY3JpcHQNCk1pbWUtVmVyc2lvbjogMS4wDQoNCiMhL3Vzci9iaW4vZW52IGJhc2gKCiMgR2V0IEN1cnJlbnQgaG9zdG5hbWUKSE9TVE5BTUVfQ1VSUkVOVD1gaG9zdG5hbWVjdGwgLS1zdGF0aWNgCgojIEdlbmVyYXRlIG5ldyBob3N0bmFtZQpIT1NUTkFNRV9ORVc9IiR7SE9TVE5BTUVfQ1VSUkVOVC9pcC9iYXN0aW9uLXYyLWxvZ2ljYWxpcy1wb2MtcHJvZH0iCgojIFNldCBuZXcgaG9zdG5hbWUKaG9zdG5hbWVjdGwgc2V0LWhvc3RuYW1lICIkSE9TVE5BTUVfTkVXIgoKIyBVcGRhdGUgL2V0Yy9ob3N0cwpzZWQgLWkgInMvXjEyN1wuMFwuMFwuMSBsb2NhbGhvc3QuKi8mICRIT1NUTkFNRV9ORVcvIiAvZXRjL2hvc3RzCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
+       vpc_security_group_ids  = (known after apply)

+       block_device_mappings {
+           device_name = "/dev/sda1"

+           ebs {
+               encrypted   = "true"
+               iops        = (known after apply)
+               throughput  = 125
+               volume_size = 8
+               volume_type = "gp3"
            }
        }

+       credit_specification {
+           cpu_credits = "standard"
        }

+       iam_instance_profile {
+           name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Application" = "bastion-v2-logicalis-poc"
+               "Deployment"  = "terraform"
+               "Environment" = "prod"
+               "Monitored"   = "datadog"
+               "Name"        = "bastion-v2-logicalis-poc-prod"
+               "Resource"    = "instance"
            }
        }
+       tag_specifications {
+           resource_type = "volume"
+           tags          = {
+               "Application" = "bastion-v2-logicalis-poc"
+               "Deployment"  = "terraform"
+               "Environment" = "prod"
+               "Monitored"   = "datadog"
+               "Name"        = "bastion-v2-logicalis-poc-prod"
+               "Resource"    = "volume"
            }
        }
    }

  # module.rds-postgresql.module.db.module.asg_bastion.aws_security_group.instance will be created
+ resource "aws_security_group" "instance" {
+       arn                    = (known after apply)
+       description            = "Security group for bastion-v2-logicalis-poc-prod instances."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "bastion-v2-logicalis-poc-prod-instance"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "bastion-v2-logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-v2-logicalis-poc-prod-instance"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "bastion-v2-logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "bastion-v2-logicalis-poc-prod-instance"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.rds-postgresql.module.db.module.kms[0].aws_kms_alias.this will be created
+ resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/logicalis-poc-prod-rds"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.rds-postgresql.module.db.module.kms[0].aws_kms_key.this will be created
+ resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+       deletion_window_in_days            = 7
+       description                        = "KMS for logicalis-poc-prod RDS."
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = true
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::196353230095:root",
+                               "arn:aws:iam::165908609791:root",
                            ]
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::165908609791:root"
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               kms:GrantIsForAWSResource = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::165908609791:root"
                        }
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       tags                               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "logicalis-poc-prod"
+           "Resource"    = "kms-key"
        }
+       tags_all                           = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Name"        = "logicalis-poc-prod"
+           "Resource"    = "kms-key"
        }
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_profile.aws_iam_instance_profile.instance will be created
+ resource "aws_iam_instance_profile" "instance" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "bastion-v2-logicalis-poc-prod"
+       path        = "/"
+       role        = "bastion-v2-logicalis-poc-prod"
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_profile.aws_iam_role.instance will be created
+ resource "aws_iam_role" "instance" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "Role for bastion-v2-logicalis-poc-prod instances."
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "bastion-v2-logicalis-poc-prod"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_profile.aws_iam_role_policy.ec2_describe_tags will be created
+ resource "aws_iam_role_policy" "ec2_describe_tags" {
+       id     = (known after apply)
+       name   = "ec2-describe-tags"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "ec2:DescribeTags"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_profile.aws_iam_role_policy_attachment.sessionmanager-s3-ec2-policy-attach will be created
+ resource "aws_iam_role_policy_attachment" "sessionmanager-s3-ec2-policy-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::165908609791:policy/hlz-sessionmanager-s3-ec2-policy"
+       role       = "bastion-v2-logicalis-poc-prod"
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_profile.aws_iam_role_policy_attachment.sessionmanager-ssm-ec2-policy-attach will be created
+ resource "aws_iam_role_policy_attachment" "sessionmanager-ssm-ec2-policy-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = "bastion-v2-logicalis-poc-prod"
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.instance_s3.aws_iam_role_policy.instance_s3 will be created
+ resource "aws_iam_role_policy" "instance_s3" {
+       id     = (known after apply)
+       name   = "holaluz-apps-bastion-v2-logicalis-poc-prod-s3"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:ListBucket"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::holaluz-apps"
+                       Sid      = ""
                    },
+                   {
+                       Action   = [
+                           "s3:PutObjectAcl",
+                           "s3:PutObject",
+                           "s3:GetObjectVersion",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::holaluz-apps/bastion-v2-logicalis-poc/prod/*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.rds-postgresql.module.db.module.asg_bastion.module.iam.module.secrets.aws_iam_role_policy.this will be created
+ resource "aws_iam_role_policy" "this" {
+       id     = (known after apply)
+       name   = "bastion-v2-logicalis-poc-prod-secrets"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "secretsmanager:ListSecretVersionIds",
+                           "secretsmanager:GetSecretValue",
+                           "secretsmanager:GetResourcePolicy",
+                           "secretsmanager:DescribeSecret",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:bastion-v2-logicalis-poc-prod-application-*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

Plan: 25 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.basic_dashboard.module.ec2_monitor_asg_api.module.cpu.module.this.datadog_monitor.this,
│   on .terraform/modules/basic_dashboard/datadog/monitors/monitor/monitor.tf line 3, in resource "datadog_monitor" "this":
│    3:   locked              = false
│ 
│ Use `restricted_roles`.
│ 
│ (and 27 more similar warnings elsewhere)
╵

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   169  100    16  100   153    429   4108 --:--:-- --:--:-- --:--:--  4567
{"status": "ok"}

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod`
</details>
Plan: 25 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
